IssueTracker/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @issue = Issue.find(params[:id])

    @issue.comments << @comment
    respond_to do |format|
      if @comment.save
        @mentions = @comment.comment.split("MENTION:").last
        @mentions = @mentions.gsub(/\s+/, "")
        @mentions = @mentions.split(",")

        Notification.create(user_id: mention, notify: "There is a new comment.", link:comment_path(@comment.id))
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("comment", "issue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "Issue1 Comment1"], ["issue_id", 2], ["created_at", "2015-09-02 07:35:54.826509"], ["updated_at", "2015-09-02 07:35:54.826509"]]
INSERT INTO "mentions" ("user_id", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["comment_id", 2], ["created_at", "2015-09-05 18:04:25.810949"], ["updated_at", "2015-09-05 18:04:25.810949"]]
INSERT INTO "notifications" ("user_id", "notify", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["notify", "You have been mentioned in a issue"], ["link", "/comments/2"], ["created_at", "2015-09-05 18:04:25.963672"], ["updated_at", "2015-09-05 18:04:25.963672"]]

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]