IssueTracker/app/controllers/invites_controller.rb

SELECT "invites".* FROM "invites"
---
  def index
    @invites = Invite.all

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "invites" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["project_id", 2], ["created_at", "2015-09-05 17:55:40.620555"], ["updated_at", "2015-09-05 17:55:40.620555"]]
---
  def create
    @project = Project.find(params[:invite][:project_id])
    if @project.user_id == session[:user_id] && params[:invite][:user_id] != @project.user_id
      @invite = Invite.new(invite_params)

      respond_to do |format|
        if @invite.save

SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_invite
      @invite = Invite.find(params[:id])