IssueTracker/app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    @issues = Issue.all

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "assigns" WHERE "assigns"."id" = ?  [["id", 1]]
INSERT INTO "assigns" ("user_id", "issue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["issue_id", 3], ["created_at", "2015-09-05 17:29:23.854845"], ["updated_at", "2015-09-05 17:29:23.854845"]]
INSERT INTO "notifications" ("user_id", "notify", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["notify", "You have been assigned a issue"], ["link", "/issues/3"], ["created_at", "2015-09-05 17:30:36.722007"], ["updated_at", "2015-09-05 17:30:36.722007"]]
---
  def assign
    @issue = Issue.find(params[:id])
    @project = @issue.project

    if @issue.assign
      @issue.assign.destroy
    end
    Assign.create(user_id: params[:uid], issue_id: params[:id])
    Notification.create(user_id: params[:uid], notify: "You have been assigned a issue",link:issue_path(params[:id]))

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("user_id", "issue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["issue_id", 3], ["created_at", "2015-09-05 17:30:58.077879"], ["updated_at", "2015-09-05 17:30:58.077879"]]
---
  def voteadd
    @issue = Issue.find(params[:id])
    @user = User.find(session[:user_id])
    @project = @issue.project

    if @project.working.detect{|p| p.user_id == @user.id} && !@user.votes.detect{|v| v.issue_id == @issue.id}
      Vote.create(user_id: session[:user_id], issue_id:params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "issues" ("heading", "description", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["heading", "ryph;o"], ["description", "sjkldfha"], ["project_id", 1], ["created_at", "2015-09-02 01:23:43.827710"], ["updated_at", "2015-09-02 01:23:43.827710"]]
SELECT "workings".* FROM "workings" WHERE "workings"."project_id" = ?  [["project_id", 1]]
INSERT INTO "notifications" ("user_id", "notify", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["notify", "There is a new issue"], ["link", "/comments/3"], ["created_at", "2015-09-05 17:11:38.149458"], ["updated_at", "2015-09-05 17:11:38.149458"]]
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      @project = Project.find(params[:id])
      @project.issues << @issue
      if @issue.save
        @project.working.each do |w|
          @user = w.user
          Notification.create(user_id: @user.id, notify: "There is a new issue",link:issue_path(@issue.id))

UPDATE "issues" SET "heading" = ?, "description" = ?, "open" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["heading", "Issue2 App1"], ["description", "Issue Description2 App1"], ["open", "f"], ["updated_at", "2015-09-02 13:16:11.821675"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @issue.update(issue_params)

DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 1]]
---
  def destroy
    @issue.destroy

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_issue
      @issue = Issue.find(params[:id])