IssueTracker/app/controllers/project_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @project = Project.find(params[:id])

    puts @project.working.detect{|p| p.id == session[:user_id] }
    if check(@project.id) == 0
      redirect_to '/'
    end

    @user = User.find(@project.user_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [[nil, 1]]
SELECT "workings".* FROM "workings" WHERE "workings"."project_id" = ?  [["project_id", 1]]

  def add
    @user = User.find(session[:user_id])
    @project = Project.find(params[:id])
    @invite = @user.invite.detect{|i| i.project_id == @project.id}

    if @invite
      @invite.destroy
      Working.create(user_id: @user.id, project_id: @project.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "invites" WHERE "invites"."id" = ?  [["id", 1]]
INSERT INTO "workings" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["project_id", 2], ["created_at", "2015-09-05 17:55:51.102018"], ["updated_at", "2015-09-05 17:55:51.102018"]]

  def remove
    @project = Project.find(params[:id])
    @user = User.find(params[:rem])

    @working = @project.working.detect{|p| p.user_id == @user.id}
    if @working && @project.user != @user
      @working.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "workings" WHERE "workings"."id" = ?  [["id", 3]]

  def create
    @project = Project.new(project_params)
    @user = User.find(session[:user_id])
    @user.projects << @project
    Working.create(user_id: @user.id, project_id: @project.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "projects" ("name", "description", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "App1"], ["description", "App1 Description 1"], ["private", "t"], ["user_id", 1], ["created_at", "2015-09-05 16:51:32.119692"], ["updated_at", "2015-09-05 16:51:32.119692"]]
INSERT INTO "workings" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["project_id", 1], ["created_at", "2015-09-05 16:51:32.356060"], ["updated_at", "2015-09-05 16:51:32.356060"]]