IssueTracker/app/controllers/project_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all