IssueTracker/app/controllers/users_controller.rb

  def index
    if (!session[:user_id])
      redirect_to '/login'
    end
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @user = User.new(user_param)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)