IssueTracker/app/views/comments/index.html.erb

      <div style="border:1px solid black; margin:1px;">
        <h3> <%= link_to Issue.find(comment.issue_id).heading, issue_path(Issue.find(comment.issue_id)) %> </h3>
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 2]]