IssueTracker/app/views/issues/index.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
      <div >
         <h3> <%= issue.heading %> (<%= Project.find(issue.project_id).name %>)</h3>