IssueTracker/app/views/issues/show.html.erb

<%= link_to 'Edit', edit_issue_path(@issue) %> |
<%= link_to 'Back', id_path(Project.find(@issue.project_id)) %>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]

  <% if @issue.dupl %>Marked Duplicate <% end %>
<p>Votes:<%= @issue.votes.count %></p>
---
SELECT "votes".* FROM "votes" WHERE "votes"."issue_id" = ?  [["issue_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."issue_id" = ?  [["issue_id", 1]]

<%if @issue.assign %>
<h5> Assigned To: <%= @issue.assign.user.first_name %> <%= @issue.assign.user.last_name %> </h5>
---
SELECT  "assigns".* FROM "assigns" WHERE "assigns"."issue_id" = ? LIMIT 1  [["issue_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]