IssueTracker/app/views/project/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  </h2>
  Owner: <%= @project.user.first_name %> <%= @project.user.last_name %><br>

SELECT  "assigns".* FROM "assigns" WHERE "assigns"."issue_id" = ? LIMIT 1  [["issue_id", 1]]
---
        <% if issue.assign %>
        <%= issue.assign.user.first_name %> <%= issue.assign.user.last_name %>

SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = ?  [["project_id", 1]]
---
    console.log(search);
    for(var i=0; i<Issues.length; i++)